{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "GroundingDinoForObjectDetection",
    "parent_library": "transformers.models.grounding_dino.modeling_grounding_dino"
  },
  "base_model_name_or_path": "./model",
  "bias": "none",
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 8,
  "lora_bias": false,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "deformable_layer.output_proj",
    "deformable_layer.sampling_offsets",
    "encoder_output_bbox_embed.layersbbox_embed.0-5.layers",
    "decoder.bbox_embed.0-5",
    "input_proj_vision.0.0",
    "deformable_layer.fc2",
    "conv_encoder.projection",
    "deformable_layer.attention_weights",
    "fusion_layer.out_vision_proj",
    "deformable_layer.value_proj",
    "deformable_layer.fc1",
    "input_proj_vision.1.0",
    "fusion_layer.vision_proj",
    "input_proj_vision.3.0",
    "input_proj_vision.2.0",
    "fusion_layer.values_vision_proj"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}